// 1. Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.
const array1 = ['a', 'b', 'c'];
const array2 = [1,2,3];
const concatArray = new Array(array1.concat(array2));
document.write(`<p>${concatArray}</p>`);

// 2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.
const array11 = ['a', 'b', 'c'];
array11.push(1,2,3);
document.write(`<p>${array11}</p>`);

// 3.Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].
const array22 = [1,2,3];
document.write(`<p>${array22.reverse()}</p>`);

// 4. Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.
const array23 = [1,2,3];
array23.splice(3,0,4,5,6);
document.write(`<p>${array23}</p>`);

// 5. Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.
const array24 = [1,2,3];
array24.unshift(4,5,6);
document.write(`<p>${array24}</p>`);

// 6. Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.
const array12 = ['js', 'css', 'jq']
document.write(`<p>${array12[0]}</p>`);

// 7. Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].
const array13 = [1, 2, 3, 4, 5];
const newArray13 = array13.slice(0,3);
document.write(`<p>${newArray13}</p>`);

// 8. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].
const array14 = [1, 2, 3, 4, 5];
array14.splice(0,5,1,4,5);
document.write(`<p>${array14}</p>`);

// 9. Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].
const array15 = [1, 2, 3, 4, 5];
array15.splice(2,0,10);
document.write(`<p>${array15}</p>`);

// 10. Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
const arrSort = [3, 4, 1, 2, 7];
document.write(`<p>${arrSort.sort()}</p>`);

// 11. Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.
const arr99 = ['Привіт, ', 'світ' , '!'];
arr99.splice(1,1,'мир');
const arr98 = arr99.join(' '); // вопрос почему он не разделяет пробелом????
document.write(`<p>${arr98}</p>`);

// 12. Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, ').
const arr97 = ['Привіт, ', 'світ' , '!'];
arr97[0] = 'Поки';
document.write(`<p>${arr97}</p>`);

// 13. Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.
const arr = [1,2,3,4,5];
document.write(`<p>${arr}</p>`);
const arr1 = new Array(1,2,3,4,5);
document.write(`<p>${arr1}</p>`);

// 14. Дан багатовимірний масив arr: var arrInArr = [['блакитний', 'червоний', 'зелений'],['blue', 'red', 'green'],]; Виведіть за його допомогою слово 'блакитний' 'blue' .
const arrInArr = [['блакитний', 'червоний', 'зелений'],['blue', 'red', 'green'],];
document.write(`<p> ${arrInArr[0][0]} ${arrInArr[1][0]}</p>`);

// 15. Створити програму реєстратор нового учасника.  Ми маємо натиснути на кнопку додати нового студента, при натиску на кнопку у вас має з'явитись вікно запиту інформації якe приймає дані у вигляді "Імя.Прізвище.Мова програмування". Виводити кожного доданого студента на сторінку у таблицю, у футері таблиці має бути поле яке рахуватиме загальну кількість студентів.


// 16. Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.
const arr44 = ['a', 'b', 'c', 'd'];
document.write(`<p>${arr44[0]}+${arr44[1]}, ${arr44[2]}+${arr44[3]}</p>`);

// 17. Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву.
const result = parseInt(prompt('Введіть кількість єлементів від 1 до 100:'));
const numbers = new Array (result);
for (let i = 0; i < numbers.length; i++) {
  numbers[i] = (i + 1);
}
document.write(`<hr> ${numbers} <hr>`);

// 18. Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.
// варіант 1: через цикл for -------------------------------------------------------- (для перегляду результату варіант 1 розкоментувати а варіант2 закоментувати)
// for(let i = 0; i < numbers.length; i++) {
//   if(numbers[i] % 2 == 0){
//     document.write(`<span style="background-color: red">Парні єлементи: ${numbers[i]}</span><br>`);
//   } else {
//     document.write(`<p>Не парні єлементи: ${numbers[i]}</p>`);
//   }
// }
// варіант 2: через метод filter -------------------------------------------------------- (для перегляду результату варіант 1 закоментувати а варіант2 розкоментувати)
const evenArr = numbers.filter((n) => n % 2 == 0); 
const oddArr = numbers.filter((n) => n % 2 !== 0);
  document.write(`<p>Не парні єлементи: ${oddArr}</p>`);
  document.write(`<span style="background-color: red">Парні єлементи: ${evenArr}</span><br>`);

// 19. Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.
const vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морковка'];
const str1 = vegetables.join(', ');
document.write(str1 + '<br>');